app/Controllers/Product.php

    public function index()
    {
        $model = new ProductModel();

        $data['products_detail'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `Products`
ORDER BY `id` DESC

    public function store()
    {
        helper(['form', 'url']);

        $model = new ProductModel();

        $data = [
            'name' => $this->request->getVar('txtName'),
            'text'  => $this->request->getVar('txtText'),
            'price'  => $this->request->getVar('txtPrice'),
        ];
        $save = $model->insert_data($data);
        if ($save != false) {
            $data = $model->where('id', $save)->first();
---
SELECT *
FROM `Products`
WHERE `id` = 13
 LIMIT 1

    public function edit($id = null)
    {

        $model = new ProductModel();

        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `Products`
WHERE `id` = '1'
 LIMIT 1

    public function update()
    {

        helper(['form', 'url']);

        $model = new ProductModel();

        $id = $this->request->getVar('hdnProductId');

        $data = [
            'name' => $this->request->getVar('txtName'),
            'text'  => $this->request->getVar('txtText'),
            'price'  => $this->request->getVar('txtPrice'),
        ];

        $update = $model->update($id, $data);
        if ($update != false) {
            $data = $model->where('id', $id)->first();
---
SELECT *
FROM `Products`
WHERE `id` = '13'
 LIMIT 1

    public function delete($id = null)
    {
        $model = new ProductModel();
        $delete = $model->where('id', $id)->delete();
---
DELETE FROM `Products`
WHERE `id` = '12'