app/Models/ProductModel.php

INSERT INTO `Products` (`name`, `text`, `price`) VALUES ('az', 'az', 'az')
---
     public function insert_data($data) {
        if($this->db->table($this->table)->insert($data))